#입력값 X
#3으로 나누어떨어지면 3으로 나눈다
#2로 나누어 떨어지면 2로 나눈다
#1을 뺀다
#3가지 연산 중 하나를 수행 후 카운트 증가
#1을 만들 수 있는 최소 횟수 출력
#dp = [99999 for _ in range(100001)]
#dp[i] = min(dp[i//2],dp[i//3],dp[i-1]) + 1
#dp[1] = 0
#dp[2] = min(0,999999999,0) + 1 = 1
#dp[3] = min(999999999,0,1) + 1 = 1
#dp[4] = min(1,999999999,1) + 1 = 2
#dp[5] = min(99999999,9999999,2) + 1 = 3
#dp[6] = min(1,1,3) + 1 = 2
#dp[7] = min(999999,999999,2) + 1 = 3
#dp[8] = min(2,9999999,3) + 1  = 3
#dp[9] = min(999999999,1,3) + 1 = 2
#dp[10] = min(3,99999999,2) + 1 = 3
N = int(input())
dp = [9999999 for _ in range(1000001)]
dp[1] = 0
for i in range(2,N+1):
  dp[i] = min(dp[i//2] if i%2==0 else 9999999, dp[i//3] if i%3==0 else 9999999, dp[i-1]) + 1
print(dp[N])